#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.backend_func.azurerm_api_management_api.apim_platform_cdc_api_v1 will be created
  + resource "azurerm_api_management_api" "apim_platform_cdc_api_v1" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "IO CDC PUBLIC API"
      + display_name          = "IO CDC PUBLIC API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-cdc-public-api"
      + path                  = "api/cdc"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = "https://io-p-itn-cdc-backend-func-01.azurewebsites.net/api/v1"
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-cdc/refs/heads/main/apps/backend-func/api/internal.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.backend_func.azurerm_api_management_api_policy.apim_platform_cdc_api_v1_policy will be created
  + resource "azurerm_api_management_api_policy" "apim_platform_cdc_api_v1_policy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-cdc-public-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.backend_func.azurerm_api_management_api_version_set.apim_platform_cdc_api_version_set will be created
  + resource "azurerm_api_management_api_version_set" "apim_platform_cdc_api_version_set" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "V1 APIs"
      + id                  = (known after apply)
      + name                = "apim_platform_cdc_api_v1"
      + resource_group_name = "io-p-itn-common-rg-01"
      + versioning_scheme   = "Segment"
    }

  # module.backend_func.azurerm_api_management_product.apim_platform_cdc_product will be created
  + resource "azurerm_api_management_product" "apim_platform_cdc_product" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + approval_required     = false
      + description           = "Product for IO CDC"
      + display_name          = "IO CDC PUBLIC API"
      + id                    = (known after apply)
      + product_id            = "io-cdc-public-api"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = false
    }

  # module.backend_func.azurerm_api_management_product_api.apim_platform_cdc_api_v1_product will be created
  + resource "azurerm_api_management_product_api" "apim_platform_cdc_api_v1_product" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-cdc-public-api"
      + id                  = (known after apply)
      + product_id          = "io-cdc-public-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.backend_func.azurerm_api_management_product_policy.apim_platform_cdc_product_policy will be created
  + resource "azurerm_api_management_product_policy" "apim_platform_cdc_product_policy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + id                  = (known after apply)
      + product_id          = "io-cdc-public-api"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.backend_func.module.cdc_backend_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-backend-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                                   = "CDC"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CDC"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.storage_fe.module.cdc_storage_fe.azurerm_storage_account.this,
  on .terraform/modules/storage_fe.cdc_storage_fe/storage_account.tf line 2, in resource "azurerm_storage_account" "this":
   2: resource "azurerm_storage_account" "this" {

this block has been deprecated and superseded by the
`azurerm_storage_account_static_website` resource and will be removed in v5.0
of the AzureRM provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
